src/cfe/КСП/Documents/КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов</Name>
			<BasedOn>
				<xr:Item>Document.КСП_ЧекЛистПроверкиКачестваПряжи</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КСП_ПроверкаКачестваТестовыхОтвязовПоЧекЛистам</xr:Item>
				<xr:Item>InformationRegister.КСП_ПаспортКачества</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КСП_ЧекЛистПроверкиКачестваПряжи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаЗавершенияПретензионнойРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПотребности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбразецОтвязаПереданКонфекционеру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоЛотам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДляТестовогоОтвяза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБрака</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзмененияНормыВремениВязания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзмененияНормыВремениПошива</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзмененияНормыРасходаПряжи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СогласованиеОтклонения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверкаЗавершена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗавершенияПроверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПотерьНаВходномКонтроле</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПотерьНаВходномКонтроле</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрольКачества</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПунктПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КСП_ПунктыПроверкиКачестваПоЧекЛистам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норматив</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиДляСвязиСФото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФотоДефектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлу</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиДляСвязиСФото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТехХарактеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлу</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/КСП/Enums/КСП_ЭтапыПроверкиКачестваПоЧекЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>КСП_ЭтапыПроверкиКачестваПоЧекЛистам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВизуальныйКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольнаяПеремотка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестовыйОтвяз</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/КСП/Catalogs/КСП_ПунктыПроверкиКачестваПоЧекЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>КСП_ПунктыПроверкиКачестваПоЧекЛистам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическиВключатьВЧекЛисты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСП_ЭтапыПроверкиКачестваПоЧекЛистам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/КСП/Documents/КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	РегламентированнаяОтчетность.ДобавитьПрефиксОрганизации(ЭтотОбъект, Префикс);
КонецПроцедуры 

Функция ПолучитьПунктыПроверкиДляАвтозаполнения(ЭтапПроверки)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПунктыПроверкиКачестваПоЧекЛистам.Ссылка КАК ПунктПроверки
		|ИЗ
		|	Справочник.КСП_ПунктыПроверкиКачестваПоЧекЛистам КАК ПунктыПроверкиКачестваПоЧекЛистам
		|ГДЕ
		|	ПунктыПроверкиКачестваПоЧекЛистам.ПометкаУдаления = ЛОЖЬ
		|	И ПунктыПроверкиКачестваПоЧекЛистам.АвтоматическиВключатьВЧекЛисты = ИСТИНА
		|	И ПунктыПроверкиКачестваПоЧекЛистам.ЭтапПроверки = &ЭтапПроверки";
	
	Запрос.УстановитьПараметр("ЭтапПроверки", ЭтапПроверки);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьДанныеДляЗаполненияТовары(ЧекЛистПроверкиКачестваПряжи)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекЛистПроверкиКачестваПряжиТовары.Номенклатура,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Характеристика,
		|	ЧекЛистПроверкиКачестваПряжиТовары.ЕдиницаИзмерения,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Коэффициент,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Количество,
		|	ЧекЛистПроверкиКачестваПряжиТовары.ПоЛотам
		|ИЗ
		|	Документ.КСП_ЧекЛистПроверкиКачестваПряжи.Товары КАК ЧекЛистПроверкиКачестваПряжиТовары
		|ГДЕ
		|	ЧекЛистПроверкиКачестваПряжиТовары.Ссылка = &ЧекЛистПроверкиКачестваПряжи";
	
	Запрос.УстановитьПараметр("ЧекЛистПроверкиКачестваПряжи", ЧекЛистПроверкиКачестваПряжи);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПроверкаЗавершенностиКонтроляКачестваПряжи(ЧекЛистПроверкиКачестваПряжи)
	ПроверкаКачестваПряжиЗавершена = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекЛистПроверкиКачестваПряжиТовары.Номенклатура,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Характеристика,
		|	ЧекЛистПроверкиКачестваПряжиТовары.НомерСтроки,
		|	""Визуальный осмотр"" КАК ЭтапКонтроля
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.КСП_ЧекЛистПроверкиКачестваПряжи.Товары КАК ЧекЛистПроверкиКачестваПряжиТовары
		|ГДЕ
		|	ЧекЛистПроверкиКачестваПряжиТовары.Ссылка = &ЧекЛистПроверкиКачестваПряжи
		|	И ЧекЛистПроверкиКачестваПряжиТовары.ВизуальныйОсмотрПроверкаЗавершена = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекЛистПроверкиКачестваПряжиТовары.Номенклатура,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Характеристика,
		|	ЧекЛистПроверкиКачестваПряжиТовары.НомерСтроки,
		|	""Контрольная перемотка""
		|ИЗ
		|	Документ.КСП_ЧекЛистПроверкиКачестваПряжи.Товары КАК ЧекЛистПроверкиКачестваПряжиТовары
		|ГДЕ
		|	ЧекЛистПроверкиКачестваПряжиТовары.Ссылка = &ЧекЛистПроверкиКачестваПряжи
		|	И ВЫБОР
		|			КОГДА ЧекЛистПроверкиКачестваПряжиТовары.Ссылка.КонтрольнаяПеремоткаНеПроводилась
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ЧекЛистПроверкиКачестваПряжиТовары.КонтрольнаяПеремоткаПроверкаЗавершена = ЛОЖЬ
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Номенклатура,
		|	ВТ.Характеристика,
		|	ВТ.НомерСтроки КАК НомерСтроки,
		|	ВТ.ЭтапКонтроля КАК ЭтапКонтроля
		|ИЗ
		|	ВТ КАК ВТ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтапКонтроля,
		|	НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ";
	
	Запрос.УстановитьПараметр("ЧекЛистПроверкиКачестваПряжи", ЧекЛистПроверкиКачестваПряжи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПроверкаКачестваПряжиЗавершена = Ложь;
		Сообщить("В документе основании по номенклатуре " + ВыборкаДетальныеЗаписи.Номенклатура + " " + ВыборкаДетальныеЗаписи.Характеристика + " в строке " + ВыборкаДетальныеЗаписи.НомерСтроки + " не был выполнен контроль качества на этапе " + ВыборкаДетальныеЗаписи.ЭтапКонтроля + ".", СтатусСообщения.Внимание);
	КонецЦикла;
	
	Если Не ПроверкаКачестваПряжиЗавершена Тогда
		Сообщить("Ввод на основании невозможен. Сначала завершите контроль качества!", СтатусСообщения.Важное);
	КонецЕсли;
	
	Возврат ПроверкаКачестваПряжиЗавершена;
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КСП_ЧекЛистПроверкиКачестваПряжи") Тогда
		Если Не ПроверкаЗавершенностиКонтроляКачестваПряжи(ДанныеЗаполнения) Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения;
		Комментарий = "Введен на основании документа " + ДанныеЗаполнения; 
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ДатаПоступления = ДанныеЗаполнения.ДокументОснование.ДокументОснование.Дата;
		ПунктыПроверкиДляАвтозаполнения = ПолучитьПунктыПроверкиДляАвтозаполнения(Перечисления.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.ТестовыйОтвяз);
        Товары.Загрузить(ПолучитьДанныеДляЗаполненияТовары(ДанныеЗаполнения));
		КонтрольКачества.Очистить();
		ФотоДефектов.Очистить();
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			ТекСтрокаТовары.КлючСтроки = Новый УникальныйИдентификатор;
			Для Каждого ПунктПроверкиДляАвтозаполнения Из ПунктыПроверкиДляАвтозаполнения Цикл
				СтрокаПунктКонтроляКачества = КонтрольКачества.Добавить();
				СтрокаПунктКонтроляКачества.КлючСтроки = ТекСтрокаТовары.КлючСтроки;
				СтрокаПунктКонтроляКачества.ПунктПроверки = ПунктПроверкиДляАвтозаполнения.ПунктПроверки;
				СтрокаПунктКонтроляКачества.КлючСтрокиДляСвязиСФото = Новый УникальныйИдентификатор;
			КонецЦикла;
		КонецЦикла;   
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТаблицуПроверкаКачестваТестовыхОтвязовПоЧекЛистам()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Ссылка.Организация,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Ссылка.Контрагент,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Ссылка.ДатаПоступления,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Ссылка.ПлановаяДатаЗавершенияПретензионнойРаботы,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Ссылка.ДатаПотребности,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Номенклатура,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Характеристика,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Количество * ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Коэффициент КАК Количество,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.КоличествоДляТестовогоОтвяза * ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Коэффициент КАК КоличествоДляТестовогоОтвяза,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.КоличествоБрака * ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Коэффициент КАК КоличествоБрака,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.ПроцентИзмененияНормыВремениВязания,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.ПроцентИзмененияНормыВремениПошива,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.ПроцентИзмененияНормыРасходаПряжи,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.СогласованиеОтклонения,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Комментарий,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.ПроверкаЗавершена,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.ДатаЗавершенияПроверки,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.ПроцентПотерьНаВходномКонтроле,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.СуммаПотерьНаВходномКонтроле,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов.Товары КАК ЧекЛистПроверкиКачестваТестовыхОтвязовТовары
		|ГДЕ
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборДвижений = Движения.КСП_ПроверкаКачестваТестовыхОтвязовПоЧекЛистам;  
	НаборДвижений.мТаблицаДвижений   = ПолучитьТаблицуПроверкаКачестваТестовыхОтвязовПоЧекЛистам();
	НаборДвижений.ВыполнитьДвижения();
КонецПроцедуры
